Revit 2026 API

# RibbonPanel Properties

---

The RibbonPanel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Enabled | Gets or sets a value indicating whether the RibbonPanel can respond to user interaction. |
|  | Name | Gets or sets the name of the RibbonPanel. |
|  | Title | Gets or sets the text of the RibbonPanel. |
|  | Visible | Gets or sets a value indicating whether the RibbonPanel is displayed. |

#### Reference

RibbonPanel Class

Autodesk.Revit.UI Namespace